<h1 style='color:white;font-size:25px;font-weight:700;margin-top:30px'>Розвязування задачі на основі Pandas</h1>

In [47]:
import pandas as pd

<h2 style = 'color:#white;font-size:20px'>1. Імпорт даних та читання <b><i>csv</i></b> файлу </h2>

In [48]:
df = pd.read_csv('C:/Users/den/Desktop/pandas/pandas-learn/data/restaraunts.csv')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 254 entries, 0 to 253
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order ID        254 non-null    int64
 1   Date            254 non-null    object
 2   Product         254 non-null    object
 3   Price           254 non-null    float64
 4   Quantity        254 non-null    float64
 5   Purchase Type   254 non-null    object
 6   Payment Method  254 non-null    object
 7   Manager         254 non-null    object
 8   City            254 non-null    object
dtypes: float64(2), int64(1), object(6)
memory usage: 18.0+ KB

<h2 style = 'color:#white;font-size:20px'>2. Визиваємо процедуру яка описує к-сть та інші числові значення для числових показників </h2>

In [49]:
df.describe()

           Order ID       Price    Quantity
count    254.000000  254.000000  254.000000
mean   10584.133858    7.102323  460.611457
std       75.889181    4.341855  214.888699
min    10452.000000    2.950000  200.400000
25%    10520.250000    3.490000  201.010000
50%    10583.500000    4.990000  538.880000
75%    10649.750000    9.950000  677.440000
max    10713.000000   29.050000  754.430000

<h2 style = 'color:#white;font-size:20px'>3. Викликаємо процедуру для перевірки пустих значень</h2>

In [50]:
df.isna().sum()

Order ID          0
Date              0
Product           0
Price             0
Quantity          0
Purchase Type     0
Payment Method    0
Manager           0
City              0
dtype: int64

<h2 style = 'color:#white;font-size:20px'>4. Найбільш бажаний спосіб оплати? </h2>

In [51]:
df['Payment Method'].value_counts()

Payment Method
Credit Card    120
Cash            76
Gift Card       58
Name: count, dtype: int64

<h2 style = 'color:#white;font-size:20px'>5. Найбільш продаваний продукт – за кількістю та за доходом? </h2>

In [52]:
df.groupby('Product')['Quantity'].sum().sort_values(ascending=False)

Product
Beverages             34983.14
Fries                 32034.34
Burgers               29022.31
Chicken Sandwiches    11135.92
Sides & Other          9819.60
Name: Quantity, dtype: float64

In [53]:
df ['Revenue'] = df['Price'] * df['Quantity']

df.groupby('Product')['Revenue'].sum().sort_values(ascending=False)

Product
Burgers               376999.8069
Fries                 125674.2903
Chicken Sandwiches    114641.6950
Beverages             103200.2630
Sides & Other          48999.8040
Name: Revenue, dtype: float64

<h2 style = 'color:#white;font-size:20px'>6. Яке місто мало максимальний дохід, або який менеджер отримав максимальний дохід? </h2>

In [54]:
df.groupby('City')['Revenue'].sum().sort_values(ascending=False)

City
Lisbon    241714.1157
London    211201.0406
Madrid    136200.2665
Berlin    100600.1313
Paris      79800.3051
Name: Revenue, dtype: float64

In [55]:
df.groupby('Manager')['Revenue'].sum().sort_values(ascending=False)

Manager
Joao Silva            225074.7665
Tom Jackson           209201.0263
Pablo Perez           107600.2549
Walter Muller         100600.1313
Remy Monet             72800.2690
       Pablo Perez     23200.0330
Joao    Silva          16639.3492
       Remy Monet       4000.0258
Pablo  Perez            2199.9913
Pablo   Perez           2199.9913
Tom      Jackson        2000.0143
Remy    Monet           2000.0143
Pablo    Perez           999.9960
Remy     Monet           999.9960
Name: Revenue, dtype: float64

<h2 style = 'color:#white;font-size:20px'>7. Дохід за датами. </h2>

In [56]:
df.groupby('Date')['Revenue'].sum().sort_values(ascending=True)

Date
07-11-2022     5200.0023
20-11-2022     8200.0466
04-12-2022     9000.1007
08-11-2022    12400.0731
10-11-2022    13200.0426
26-11-2022    13200.0638
27-11-2022    13399.9799
25-11-2022    13399.9799
28-11-2022    13400.0454
29-11-2022    13400.0454
01-12-2022    13400.1144
22-11-2022    13599.9918
24-11-2022    13600.0259
15-11-2022    13600.0305
16-11-2022    13600.0305
30-11-2022    13600.0914
23-11-2022    13800.0378
19-11-2022    14000.0194
12-11-2022    14000.0535
07-12-2022    14000.0535
02-12-2022    14000.0535
17-11-2022    14000.0535
03-12-2022    14000.0535
21-11-2022    14000.0838
06-12-2022    14000.1225
09-11-2022    14200.0386
05-12-2022    14200.0386
08-12-2022    14200.0995
11-11-2022    14400.0156
15-12-2022    14400.0945
18-11-2022    14400.1114
14-12-2022    14600.0106
10-12-2022    14600.0616
09-12-2022    14600.0616
13-12-2022    14600.0616
12-12-2022    14600.0616
16-12-2022    15000.0371
11-12-2022    15000.0881
17-12-2022    15400.0950
18-12-2022    15600.0111
19-12-2022    15799.9613
20-12-2022    16000.0073
23-12-2022    16000.0218
21-12-2022    16399.9694
24-12-2022    16399.9839
22-12-2022    16599.9644
25-12-2022    16599.9789
29-12-2022    16800.0780
27-12-2022    17000.0199
26-12-2022    17000.0199
28-12-2022    17599.9770
14-11-2022    17839.3445
13-11-2022    27674.4512
Name: Revenue, dtype: float64

<h2 style = 'color:#white;font-size:20px'>8. Середній дохід</h2>

In [57]:
df['Revenue'].mean()

np.float64(3029.589996850394)

<h2 style = 'color:#white;font-size:20px'>9. Середній дохід за листопад та грудень</h2>

In [58]:
df['Date'] = pd.to_datetime(df['Date'],format='mixed') 

df['Month'] = df['Date'].dt.month

df[(df['Month'] == 11) | (df['Month']==12)]['Revenue'].mean()

np.float64(3081.230069109948)

<h2 style = 'color:#white;font-size:20px'>10. Стандартне відхилення доходу та кількості?</h2>

In [59]:
df['Revenue'].std()

np.float64(2420.11837804107)

In [60]:
df['Quantity'].std()

np.float64(214.88869921528874)

<h2 style = 'color:#white;font-size:20px'>11. Чи збільшується дохід з часом, чи зменшується?</h2>

In [61]:
df.groupby('Month')['Revenue'].mean()

Month
1     2680.022880
2     2800.010700
3     2800.010700
4     4500.050350
5     2840.007720
6     2800.024500
7     2400.006975
8     2955.574733
9     2880.010020
10    3088.900467
11    2970.252953
12    3195.749009
Name: Revenue, dtype: float64

<h2 style = 'color:#white;font-size:20px'>12. Середня «кількість проданих товарів» та «середній дохід» для кожного продукту?</h2>

In [ ]:
df.groupby('Product')[['Revenue','Quantity']].agg({'Revenue':'mean','Quantity':'mean'}).sort_values('Revenue',ascending=False)

                        Revenue    Quantity
Product
Burgers             7249.996287  558.121346
Fries               2464.201771  628.124314
Chicken Sandwiches  2204.647981  214.152308
Beverages           2064.005260  699.662800
Sides & Other        999.996000  200.400000

: